---
kind: type
id: T:Autodesk.Revit.DB.TemporaryViewMode
source: html/8c0c72db-2801-3642-72bb-108cfdff23e1.htm
---
# Autodesk.Revit.DB.TemporaryViewMode

Enumeration to represent the various temporary view modes a view can be in.

## Syntax (C#)
```csharp
public enum TemporaryViewMode
```